12_Authentication/11_solutions/brian_advanced_ritly_solution/app/controllers/urls_controller.rb

SELECT  "urls".* FROM "urls"  WHERE "urls"."id" = ? LIMIT 1  [["id", 1]]
---
  def show
    @url = Url.find(params[:id])

SELECT  "urls".* FROM "urls"  WHERE "urls"."hash_code" = 'QbAHS44hnzU' LIMIT 1
---
  def redirector
    @url = Url.find_by(hash_code: params[:hash_code])

SELECT  "urls".* FROM "urls"  WHERE "urls"."hash_code" = 'XvV-bBkjWOU' LIMIT 1
---
  def preview
    @url = Url.find_by(hash_code: params[:hash_code])